{
    "architectures": [
      "Qwen2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "head_dim": 64,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "max_position_embeddings": 131072,
    "max_window_layers": 16,
    "model_type": "swan_nsa",
    "num_attention_heads": 16,
    "num_hidden_layers": 16,
    "num_key_value_heads": 2,
    "nsa_num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_theta": 10000.0,
    "sliding_window": 512,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.1",
    "use_cache": true,
    "use_sliding_window": true,
    "vocab_size": 100278,
    "full_attn_interleave": 1,
    "_attn_implementation": "flash_attention_3",
    "nsa_block_size": 64,
    "nsa_block_counts": 32,
    "nsa_window_size": 512,
    "nsa_use_rope": true
}
