{
    "architectures": [
      "Qwen2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "head_dim": 64,
    "initializer_range": 0.02,
    "intermediate_size": 5632,
    "max_position_embeddings": 8192,
    "max_window_layers": 22,
    "model_type": "swangpt",
    "num_attention_heads": 32,
    "num_hidden_layers": 22,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-05,
    "rope_theta": 10000.0,
    "sliding_window": 512,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.1",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 100278,
    "full_attn_interleave": 1,
    "_attn_implementation": "flash_attention_3",
    "rope_full_attn": true
}
