{
    "architectures": [
      "InfLLMv2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "head_dim": 128,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "max_position_embeddings": 8192,
    "max_window_layers": 16,
    "model_type": "infllmv2",
    "num_attention_heads": 8,
    "num_hidden_layers": 16,
    "num_key_value_heads": 1,
    "rms_norm_eps": 1e-06,
    "rope_theta": 10000.0,
    "sliding_window": 512,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.1",
    "use_cache": true,
    "use_sliding_window": true,
    "vocab_size": 100278,
    "full_attn_interleave": 1,
    "_attn_implementation": "flash_attention_3",
    "rope_full_attn": true,
    "infllmv2_kernel_size": 32,
    "infllmv2_kernel_stride": 16,
    "infllmv2_block_size": 64,
    "infllmv2_topk": 32,
    "infllmv2_init_blocks": 1,
    "infllmv2_local_blocks": 8
}
